app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save!
---
INSERT INTO "posts" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Tilte"], ["content", "Content"], ["author", "Tarik"], ["created_at", "2024-08-29 14:25:45.251215"], ["updated_at", "2024-08-29 14:25:45.251215"]]