app/models/global_handler.rb


      definition = JSON.parse(File.read("app/resources/update_workflow.json"))

      workflow = Workflow.find_by(definition: definition) || Workflow.new(definition: JSON.parse(File.read("app/resources/update_workflow.json")))

      workflow.save if workflow.new_record?
---
SELECT "workflows".* FROM "workflows" WHERE "workflows"."definition" = ? LIMIT ?
INSERT INTO "workflows" ("definition", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"