app/models/workflow_processor.rb

INSERT INTO "workflow_executions" ("workflow_id", "status", "error_message", "workflow_event_store_id", "last_event_handler", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def initialize(workflow)
    @workflow = workflow
    @current_step = workflow.definition["steps"].first["id"]
    @workflow_execution = WorkflowExecution.create!(workflow: workflow, status: :not_started)

UPDATE "workflow_executions" SET "status" = ?, "workflow_event_store_id" = ?, "updated_at" = ? WHERE "workflow_executions"."id" = ?  [["status", "in_progress"], ["workflow_event_store_id", "#<ResourceCreated:0x0000000129c215f8>"], ["updated_at", "2024-09-09 19:21:06.709348"], ["id", 3]]
UPDATE "workflow_executions" SET "status" = ?, "updated_at" = ? WHERE "workflow_executions"."id" = ?  [["status", "success"], ["updated_at", "2024-09-09 19:22:23.735642"], ["id", 4]]
---
  def execute(event)
    payload = event.data
    @workflow_execution.update!(status: :in_progress, workflow_event_store_id: event.correlation_id)

    while @current_step
      step = find_step(@current_step)
      process_step(step, payload)
      @current_step = find_next_step(step, payload)
    end

    @workflow_execution.update!(status: :success)
  rescue StandardError => e
    @workflow_execution.update!(status: :failed, error_message: e.message)